{
    "Logging": {
        "LogLevel": {
            "Default": "Information",
            "Microsoft": "Warning",
            "Microsoft.AspNetCore": "Information",
            "Microsoft.Hosting.Lifetime": "Information",
            "idunno.AtProto": "Debug"
        }
    },

    "Console": {
        "LogLevel": {
            "Default": "Information",
            "Microsoft": "Warning",
            "Microsoft.AspNetCore": "Information",
            "Microsoft.Hosting.Lifetime": "Information",
            "idunno.AtProto": "Debug"
        },
        "FormatterName": "Simple",
        "FormatterOptions": {
            "SingleLine": true,
            "IncludeScopes": true,
            "TimestampFormat": "HH:mm:ss ",
            "UseUtcTimestamp": true
        }
    },

    "Kestrel": {
        "Endpoints": {
            "HTTP": {
                "Url": "http://localhost:8080",
                "Protocols": "Http1"
            }
        }
    },

    "Bot": {
        "Handle": "beans.monster",
        "WatchDids": [
            "did:plc:ec72yg6n2sydzjvtovvdlxrk",
            "did:plc:qkulxlxgznoyw4vdy7nu2mof",
            "did:plc:wtdzzfgzjpirnk5wvpjutqoy",
            "did:plc:oisofpd7lj26yvgiivf3lxsi",
            "did:plc:63hvnyjvqi2nzzcsjgnry5we"
        ],
        "ExcludeDids": [
            "did:plc:hfgp6pj3akhqxntgqwramlbg"
        ],
        "WatchWords": [
            "beanz",
            "beans",
            "bean",
            "heinz",
            "🫘"
        ],
        "Responses": [
            "Baked Beans were originally sold in the UK by Fortnum and Mason in 1901 as a luxury item. #beansFacts",
            "The first can of British-manufactured Heinz Beanz was created in the Heinz factory in Harlesden in 1928. #beansFacts",
            "Heinz has now held a Royal Warrant for over 60 years. #beansFacts",
            "Every day over one a half million cans of Heinz Baked Beans are consumed in the UK. That’s more than 540 million cans a year. #beansFacts",
            "There are approximately 465 beans per standard 415g can of Heinz Beanz. #beansFacts",
            "The small white beans used to make Heinz Beanz are a type of haricot bean called ‘Navy’ beans. #beansFacts",
            "Every individual bean is checked for colour and size before they are allowed into a can of Heinz Beanz. #beansFacts",
            "The can is first filled with blanched beans, then the sauce, then sealed, and finally cooked in the can. #beansFacts",
            "The tomato sauce is blended with a secret mix of spices to create the distinctive Heinz flavour. #beansFacts",
            "50,000 tonnes of navy beans are shipped annually from North America to Liverpool docks to make Heinz beans. #beansFacts",
            "The beans factory holds 36 hours' worth of beans at any one time in case bad weather stops their import. #beansFacts",
            "Scott took crates of Heinz Beanz on the ill-fated British Antarctic Expedition which started in 1910. #beansFacts",
            "In the 1940s, the Ministry of Food classified Heinz Beanz as an “essential food” during wartime rationing. #beansFacts",
            "Heinz Beanz are exported to more than 60 countries, including Russia and China. #beansFacts",
            "Heinz UK salesman used to carry a hot flask full of Heinz Beanz to provide samples for their customers. #beansFacts",
            "A serving of baked beans on toast, accompanied by a glass of milk, offers over a third of the recommended daily amounts of iron, vitamins B1 and B2. #beansFacts",
            "Heinz uses enough tomatoes every day to fill an Olympic size swimming pool. #beansFacts",
            "If all the tomatoes used by Heinz in a year were loaded into 15 tonne trucks parked nose to tail, they would stretch from London to Southampton. #beansFacts",
            "On The Who’s ‘Sell Out’ album cover, Roger Daltry appears immersed in Heinz Beanz and caressing a giant Heinz Beanz can. #beansFacts",
            "According to a poll of 2,000 Brits, almost eighty per cent of Brummies eat beans at least once a week. #beansFacts",
            "In 1998, Heinz Baked Beans was voted one of 12 brands that citizens of the United Kingdom think best represents the final 10 years of the millennium. #beansFacts",
            "The world record for eating six pounds of baked beans is 1min 48sec by Don Lerman of New York. #beansFacts",
            "One can of Heinz baked beans is sold in the UK every 17 seconds. #beansFacts",
            "It would take 5,000 Boeing 747s to hold the two million people who tuck into Heinz beans each day. #beansFacts",
            "11.5 million Brits admit to taking Heinz beans on holiday #beansFacts"
        ]
    }
}
